run/backwardFacingStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

a 40;
b 40;
c 200;
xi -0.055;
xf 0.055;
yi -0.055;
yf 0.055;
zi -0.05;
zf 1.05;

vertices
(
    ($xi $yi $zi) //0
    ($xf $yi $zi) //1
    ($xf $yf $zi) //2
    ($xi $yf $zi) //3
    ($xi $yi $zf) //4
    ($xf $yi $zf) //5
    ($xf $yf $zf) //6
    ($xi $yf $zf) //7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) ($a $b $c) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // frontAndBack
    // {
    //     type patch;
    //     faces
    //     (
    //         (3 7 6 2)
    //         (1 5 4 0)
    //     );
    // }
    // inlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 4 7 3)
    //     );
    // }
    // outlet
    // {
    //     type patch;
    //     faces
    //     (
    //         (2 6 5 1)
    //     );
    // }
    // lowerWall
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 3 2 1)
    //     );
    // }
    // upperWall
    // {
    //     type patch;
    //     faces
    //     (
    //         (4 5 6 7)
    //     );
    // }
);

// ************************************************************************* //
