run/backwardFacingStep/system/pressureDifferencePatch
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      pressureDifferencePatch;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
	pressureDifferencePatch
	{
		type            fieldValueDelta;
		libs            ("libfieldFunctionObjects.so");
		operation       subtract;
		writeControl    writeTime;
		log             true;

		region1
		{
    		#includeEtc "caseDicts/postProcessing/surfaceFieldValue/surfaceRegion.cfg"
    		operation       areaAverage;
    		fields          (p);
		    regionType  patch;
    		name        inlet;
		}
		region2
		{
    		#includeEtc "caseDicts/postProcessing/surfaceFieldValue/surfaceRegion.cfg"
    		operation       areaAverage;
    		fields          (p);
		    regionType  patch;
    		name        outlet;
		}
	}
