run/backwardFacingStep/system/singleGraph
start   (0.0 0.049 0.0);
end     (0.0 0.049 1.0);
fields  (Uz);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
// setConfig { type midPoint; }

// Must be last entry

#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
